### Importando Bibliotecas

In [13]:
import pandas as pd
import pymysql

# Convertendo o pymysql para o MySQLdb
pymysql.install_as_MySQLdb()

#import mysql.connector
import MySQLdb

### Configuração para conexão com o SGBD MySQL

In [14]:
db = MySQLdb.connect(
    host="localhost",
    user="root",
    password="",
    database="classificados_web"
)

### Cricar um objeto cursor
Isso permitirá que você execute todas as consultas necessárias

In [15]:
cur = db.cursor()

# Selecionar o que retornar todos os dados da tabela.
cur.execute("SELECT * FROM tipoanuncio")

#Fechar conexão
db.close()

### Criação do DF

In [16]:
# Converter os dados para DATAFRAME
tb_tipoAnuncio_mysql = pd.DataFrame(cur.fetchall())

# Visualizar os dados do DATAFRAME
tb_tipoAnuncio_mysql.head()

   0               1    2
0  1          Imovel  150
1  2    Computadores   45
2  3        Pendrive   45
3  4  Placa de V?deo   57
4  5        Hardware  323

In [18]:
#Adicionar o nome para as colunas

tb_tipoAnuncio_mysql = tb_tipoAnuncio_mysql.rename(columns={
                                                    0: 'idtipoanuncio',
                                                    1: 'nome',
                                                    2: 'qtdpalavras'
                                                })


# Visualizar os dados com as colunas renomeadas

tb_tipoAnuncio_mysql.head()

   idtipoanuncio            nome  qtdpalavras
0              1          Imovel          150
1              2    Computadores           45
2              3        Pendrive           45
3              4  Placa de V?deo           57
4              5        Hardware          323